[
    {
        "comment": "Argentina // Uruguay\nCanada // Colombia",
        "polarity": 0.0,
        "assessment": "Neutral"
    },
    {
        "comment": "huge night for andreaxfc nation… got to work the uruguay colombia semifinal for copa america socials and i interviewed mr james rodríguez (no it has not hit me yet) (we both almost cried)",
        "polarity": 0.4000000000000001,
        "assessment": "Positive"
    },
    {
        "comment": "Colombia’s starting XI for the semi final match vs Uruguay",
        "polarity": 0.0,
        "assessment": "Neutral"
    },
    {
        "comment": "Uruguay vs Colombia has been something like that",
        "polarity": 0.0,
        "assessment": "Neutral"
    },
    {
        "comment": "Darwin consoling one of his children after HE himself had to go fight Colombian fans because there was no security and bring his family to the field.\n\n#Uruguay #Colombia #CopaAmerica",
        "polarity": 0.0,
        "assessment": "Neutral"
    },
    {
        "comment": "The chaos at Uruguay-Colombia Wednesday night is a stain on the Copa America, reflecting poorly on CONMEBOL & 2026 World Cup host the US.\n\nThe players & their traumatized families deserve better than the scenes described by Uruguay captain Jose Gimenez.",
        "polarity": 0.04999999999999999,
        "assessment": "Positive"
    },
    {
        "comment": "\"Colombia\"\n\nFor the dance of his players in the locker room after taking Uruguay in the semifinals of the Copa América.First they were milk to the Uruguayans and then they make a private show, beaters and dance like a bitch children, Mondá in their splendor.",
        "polarity": 0.0,
        "assessment": "Neutral"
    },
    {
        "comment": "Fede's wife had to run with her son.In the video, it is clear how family members were thrown and they were looking for them.Until Darwin gets and start back\n#Uruguay #Colombia #Copaamerica2024",
        "polarity": 0.05000000000000001,
        "assessment": "Positive"
    },
    {
        "comment": "In the stadium they took a flag against Petro and two groups go to the blows for it until the safety of the stadium takes them out.",
        "polarity": 0.0,
        "assessment": "Neutral"
    },
    {
        "comment": "Uruguay was crazy, Darwin Núñez a violent but Luis Suarez trying to bite the Colombian Miguel Borja at the end of the game is crazy.\n#Copaamerica2024\n#Uruguaycolombia\n#Uruguay\n#Colombia\n#Bielsa\n#Conmebol",
        "polarity": -0.6,
        "assessment": "Negative"
    },
    {
        "comment": "*Uruguay attacks with 11*\n\n*Colombia defends with 10*\n\nBorja's childhood in a corner:",
        "polarity": 0.0,
        "assessment": "Neutral"
    },
    {
        "comment": "As born in this misfortune of the country I feel fully identified by this neardental.\n\nAll the honor and glory for you, is there, Sensei.",
        "polarity": 0.0,
        "assessment": "Neutral"
    },
    {
        "comment": "Bro lost the semifinals and then got beat by fans right after  #colombia #uruguay #CopaAmerica",
        "polarity": 0.2857142857142857,
        "assessment": "Positive"
    }
]